sergev/pic32sim/mz.c
/*
 * Simulate the peripherals of PIC32 microcontroller.
 *
 * Copyright (C) 2014 Serge Vakulenko, <serge@vak.ru>
 *
 * Permission to use, copy, modify, and distribute this software
 * and its documentation for any purpose and without fee is hereby
 * granted, provided that the above copyright notice appear in all
 * copies and that both that the copyright notice and this
 * permission notice and warranty disclaimer appear in supporting
 * documentation, and that the name of the author not be used in
 * advertising or publicity pertaining to distribution of the
 * software without specific, written prior permission.
 *
 * The author disclaim all warranties with regard to this
 * software, including all implied warranties of merchantability
 * and fitness.  In no event shall the author be liable for any
 * special, indirect or consequential damages or any damages
 * whatsoever resulting from loss of use, data or profits, whether
 * in an action of contract, negligence or other tortious action,
 * arising out of or in connection with the use or performance of
 * this software.
 */
#include <stdio.h>
#include <unistd.h>
#include "globals.h"
#include "pic32mz.h"

#define STORAGE(name) case name: *namep = #name;
#define READONLY(name) case name: *namep = #name; goto readonly
#define WRITEOP(name) case name: *namep = #name; goto op_##name;\
                      case name+4: *namep = #name"CLR"; goto op_##name;\
                      case name+8: *namep = #name"SET"; goto op_##name;\
                      case name+12: *namep = #name"INV"; op_##name: \
                      VALUE(name) = write_op (VALUE(name), data, address)
#define WRITEOPX(name,label) \
		      case name: *namep = #name; goto op_##label;\
                      case name+4: *namep = #name"CLR"; goto op_##label;\
                      case name+8: *namep = #name"SET"; goto op_##label;\
                      case name+12: *namep = #name"INV"; goto op_##label
#define WRITEOPR(name,romask) \
                      case name: *namep = #name; goto op_##name;\
                      case name+4: *namep = #name"CLR"; goto op_##name;\
                      case name+8: *namep = #name"SET"; goto op_##name;\
                      case name+12: *namep = #name"INV"; op_##name: \
                      VALUE(name) &= romask; \
                      VALUE(name) |= write_op (VALUE(name), data, address) & ~(romask)

static uint32_t *bootmem;       // image of boot memory

static unsigned syskey_unlock;	// syskey state

static void update_irq_status()
{
    /* Assume no interrupts pending. */
    int cause_ripl = 0;
    int vector = 0;
    VALUE(INTSTAT) = 0;

    if ((VALUE(IFS0) & VALUE(IEC0)) ||
        (VALUE(IFS1) & VALUE(IEC1)) ||
        (VALUE(IFS2) & VALUE(IEC2)) ||
        (VALUE(IFS3) & VALUE(IEC3)) ||
        (VALUE(IFS4) & VALUE(IEC4)) ||
        (VALUE(IFS5) & VALUE(IEC5)))
    {
        /* Find the most prioritive pending interrupt,
         * it's vector and level. */
        int irq;
        for (irq=0; irq<=PIC32_IRQ_LAST; irq++) {
            int n = irq >> 5;

            if (((VALUE(IFS(n)) & VALUE(IEC(n))) >> (irq & 31)) & 1) {
                /* Interrupt is pending. */
                int level = VALUE(IPC(n >> 2));
                level >>= 2 + (n & 3) * 8;
                level &= 7;
                if (level > cause_ripl) {
                    vector = n;
                    cause_ripl = level;
                }
            }
        }
        VALUE(INTSTAT) = vector | (cause_ripl << 8);
//printf ("-- vector = %d, level = %d\n", vector, level);
    }
//else printf ("-- no irq pending\n");

    eic_level_vector (cause_ripl, vector);
}

/*
 * Set interrupt flag status
 */
void irq_raise (int irq)
{
    if (VALUE(IFS(irq >> 5)) & (1 << (irq & 31)))
        return;
//printf ("-- %s() irq = %d\n", __func__, irq);
    VALUE(IFS(irq >> 5)) |= 1 << (irq & 31);
    update_irq_status();
}

/*
 * Clear interrupt flag status
 */
void irq_clear (int irq)
{
    if (! (VALUE(IFS(irq >> 5)) & (1 << (irq & 31))))
        return;
//printf ("-- %s() irq = %d\n", __func__, irq);
    VALUE(IFS(irq >> 5)) &= ~(1 << (irq & 31));
    update_irq_status();
}

static void gpio_write (int gpio_port, unsigned lat_value)
{
    /* Control SD card 0 */
    if (gpio_port == sdcard_gpio_port0 && sdcard_gpio_cs0) {
        sdcard_select (0, ! (lat_value & sdcard_gpio_cs0));
    }
    /* Control SD card 1 */
    if (gpio_port == sdcard_gpio_port1 && sdcard_gpio_cs1) {
        sdcard_select (1, ! (lat_value & sdcard_gpio_cs1));
    }
}

/*
 * Perform an assign/clear/set/invert operation.
 */
static inline unsigned write_op (a, b, op)
{
    switch (op & 0xc) {
    case 0x0: a = b;   break;   // Assign
    case 0x4: a &= ~b; break;   // Clear
    case 0x8: a |= b;  break;   // Set
    case 0xc: a ^= b;  break;   // Invert
    }
    return a;
}

unsigned io_read32 (unsigned address, unsigned *bufp, const char **namep)
{
    switch (address) {
    /*-------------------------------------------------------------------------
     * Interrupt controller registers.
     */
    STORAGE (INTCON); break;	// Interrupt Control
    STORAGE (INTSTAT); break;   // Interrupt Status
    STORAGE (IFS0); break;	// IFS(0..2) - Interrupt Flag Status
    STORAGE (IFS1); break;
    STORAGE (IFS2); break;
    STORAGE (IFS3); break;
    STORAGE (IFS4); break;
    STORAGE (IFS5); break;
    STORAGE (IEC0); break;	// IEC(0..2) - Interrupt Enable Control
    STORAGE (IEC1); break;
    STORAGE (IEC2); break;
    STORAGE (IEC3); break;
    STORAGE (IEC4); break;
    STORAGE (IEC5); break;
    STORAGE (IPC0); break;	// IPC(0..11) - Interrupt Priority Control
    STORAGE (IPC1); break;
    STORAGE (IPC2); break;
    STORAGE (IPC3); break;
    STORAGE (IPC4); break;
    STORAGE (IPC5); break;
    STORAGE (IPC6); break;
    STORAGE (IPC7); break;
    STORAGE (IPC8); break;
    STORAGE (IPC9); break;
    STORAGE (IPC10); break;
    STORAGE (IPC11); break;
    STORAGE (IPC12); break;
    STORAGE (IPC13); break;
    STORAGE (IPC14); break;
    STORAGE (IPC15); break;
    STORAGE (IPC16); break;
    STORAGE (IPC17); break;
    STORAGE (IPC18); break;
    STORAGE (IPC19); break;
    STORAGE (IPC20); break;
    STORAGE (IPC21); break;
    STORAGE (IPC22); break;
    STORAGE (IPC23); break;
    STORAGE (IPC24); break;
    STORAGE (IPC25); break;
    STORAGE (IPC26); break;
    STORAGE (IPC27); break;
    STORAGE (IPC28); break;
    STORAGE (IPC29); break;
    STORAGE (IPC30); break;
    STORAGE (IPC31); break;
    STORAGE (IPC32); break;
    STORAGE (IPC33); break;
    STORAGE (IPC34); break;
    STORAGE (IPC35); break;
    STORAGE (IPC36); break;
    STORAGE (IPC37); break;
    STORAGE (IPC38); break;
    STORAGE (IPC39); break;
    STORAGE (IPC40); break;
    STORAGE (IPC41); break;
    STORAGE (IPC42); break;
    STORAGE (IPC43); break;
    STORAGE (IPC44); break;
    STORAGE (IPC45); break;
    STORAGE (IPC46); break;
    STORAGE (IPC47); break;

    /*-------------------------------------------------------------------------
     * Prefetch controller.
     */
    STORAGE (PRECON); break;	// Prefetch Control
    STORAGE (PRESTAT); break;	// Prefetch Status

    /*-------------------------------------------------------------------------
     * System controller.
     */
    STORAGE (CFGCON); break;	// Configuration Control
    STORAGE (DEVID); break;	// Device Identifier
    STORAGE (SYSKEY); break;	// System Key
    STORAGE (RCON); break;	// Reset Control
    STORAGE (RSWRST); break;	// Software Reset
    STORAGE (OSCCON); break;	// Oscillator Control
    STORAGE (OSCTUN); break;	// Oscillator Tuning
    STORAGE (PB1DIV); break;	// Peripheral bus 1 divisor
    STORAGE (PB2DIV); break;	// Peripheral bus 2 divisor
    STORAGE (PB3DIV); break;	// Peripheral bus 3 divisor
    STORAGE (PB4DIV); break;	// Peripheral bus 4 divisor
    STORAGE (PB5DIV); break;	// Peripheral bus 5 divisor
    STORAGE (PB7DIV); break;	// Peripheral bus 7 divisor
    STORAGE (PB8DIV); break;	// Peripheral bus 8 divisor

    /*-------------------------------------------------------------------------
     * Peripheral port select registers: input.
     */
    STORAGE (INT1R); break;
    STORAGE (INT2R); break;
    STORAGE (INT3R); break;
    STORAGE (INT4R); break;
    STORAGE (T2CKR); break;
    STORAGE (T3CKR); break;
    STORAGE (T4CKR); break;
    STORAGE (T5CKR); break;
    STORAGE (T6CKR); break;
    STORAGE (T7CKR); break;
    STORAGE (T8CKR); break;
    STORAGE (T9CKR); break;
    STORAGE (IC1R); break;
    STORAGE (IC2R); break;
    STORAGE (IC3R); break;
    STORAGE (IC4R); break;
    STORAGE (IC5R); break;
    STORAGE (IC6R); break;
    STORAGE (IC7R); break;
    STORAGE (IC8R); break;
    STORAGE (IC9R); break;
    STORAGE (OCFAR); break;
    STORAGE (U1RXR); break;
    STORAGE (U1CTSR); break;
    STORAGE (U2RXR); break;
    STORAGE (U2CTSR); break;
    STORAGE (U3RXR); break;
    STORAGE (U3CTSR); break;
    STORAGE (U4RXR); break;
    STORAGE (U4CTSR); break;
    STORAGE (U5RXR); break;
    STORAGE (U5CTSR); break;
    STORAGE (U6RXR); break;
    STORAGE (U6CTSR); break;
    STORAGE (SDI1R); break;
    STORAGE (SS1R); break;
    STORAGE (SDI2R); break;
    STORAGE (SS2R); break;
    STORAGE (SDI3R); break;
    STORAGE (SS3R); break;
    STORAGE (SDI4R); break;
    STORAGE (SS4R); break;
    STORAGE (SDI5R); break;
    STORAGE (SS5R); break;
    STORAGE (SDI6R); break;
    STORAGE (SS6R); break;
    STORAGE (C1RXR); break;
    STORAGE (C2RXR); break;
    STORAGE (REFCLKI1R); break;
    STORAGE (REFCLKI3R); break;
    STORAGE (REFCLKI4R); break;

    /*-------------------------------------------------------------------------
     * Peripheral port select registers: output.
     */
    STORAGE (RPA14R); break;
    STORAGE (RPA15R); break;
    STORAGE (RPB0R); break;
    STORAGE (RPB1R); break;
    STORAGE (RPB2R); break;
    STORAGE (RPB3R); break;
    STORAGE (RPB5R); break;
    STORAGE (RPB6R); break;
    STORAGE (RPB7R); break;
    STORAGE (RPB8R); break;
    STORAGE (RPB9R); break;
    STORAGE (RPB10R); break;
    STORAGE (RPB14R); break;
    STORAGE (RPB15R); break;
    STORAGE (RPC1R); break;
    STORAGE (RPC2R); break;
    STORAGE (RPC3R); break;
    STORAGE (RPC4R); break;
    STORAGE (RPC13R); break;
    STORAGE (RPC14R); break;
    STORAGE (RPD0R); break;
    STORAGE (RPD1R); break;
    STORAGE (RPD2R); break;
    STORAGE (RPD3R); break;
    STORAGE (RPD4R); break;
    STORAGE (RPD5R); break;
    STORAGE (RPD6R); break;
    STORAGE (RPD7R); break;
    STORAGE (RPD9R); break;
    STORAGE (RPD10R); break;
    STORAGE (RPD11R); break;
    STORAGE (RPD12R); break;
    STORAGE (RPD14R); break;
    STORAGE (RPD15R); break;
    STORAGE (RPE3R); break;
    STORAGE (RPE5R); break;
    STORAGE (RPE8R); break;
    STORAGE (RPE9R); break;
    STORAGE (RPF0R); break;
    STORAGE (RPF1R); break;
    STORAGE (RPF2R); break;
    STORAGE (RPF3R); break;
    STORAGE (RPF4R); break;
    STORAGE (RPF5R); break;
    STORAGE (RPF8R); break;
    STORAGE (RPF12R); break;
    STORAGE (RPF13R); break;
    STORAGE (RPG0R); break;
    STORAGE (RPG1R); break;
    STORAGE (RPG6R); break;
    STORAGE (RPG7R); break;
    STORAGE (RPG8R); break;
    STORAGE (RPG9R); break;

    /*-------------------------------------------------------------------------
     * General purpose IO signals.
     */
    STORAGE (ANSELA); break;    // Port A: analog select
    STORAGE (TRISA); break;     // Port A: mask of inputs
    STORAGE (PORTA); break;     // Port A: read inputs
    STORAGE (LATA); break;      // Port A: read outputs
    STORAGE (ODCA); break;      // Port A: open drain configuration
    STORAGE (CNPUA); break;     // Input pin pull-up
    STORAGE (CNPDA); break;     // Input pin pull-down
    STORAGE (CNCONA); break;    // Interrupt-on-change control
    STORAGE (CNENA); break;     // Input change interrupt enable
    STORAGE (CNSTATA); break;   // Input change status

