sergev/pic32sim/mz.c
static void pps_input_group4 (unsigned address, unsigned data)
{
    // 0000 = RPD3
    // 0001 = RPG7
    // 0010 = RPF5
    // 0011 = RPD11
    // 0100 = RPF0
    // 0101 = RPB1
    // 0110 = RPE5
    // 0111 = RPC13
    // 1000 = RPB3
    // 1010 = RPC4
    // 1011 = RPD15
    // 1100 = RPG0
    // 1101 = RPA15
    // 1110 = RPD7
}

static void pps_output_group1 (unsigned address, unsigned data)
{
    // 0000 = No Connect
    // 0001 = U1TX
    // 0010 = U2RTS
    // 0011 = U5TX
    // 0100 = U6RTS
    // 0101 = SDO1
    // 0110 = SDO2
    // 0111 = SDO3
    // 1000 = SDO4
    // 1001 = SDO5
    // 1011 = OC4
    // 1100 = OC7
    // 1111 = REFCLKO1
}

static void pps_output_group2 (unsigned address, unsigned data)
{
    // 0000 = No Connect
    // 0001 = U1RTS
    // 0010 = U2TX
    // 0011 = U5RTS
    // 0100 = U6TX
    // 0110 = SS2
    // 1000 = SDO4
    // 1010 = SDO6
    // 1011 = OC2
    // 1100 = OC1
    // 1101 = OC9
    // 1111 = C2TX
}

static void pps_output_group3 (unsigned address, unsigned data)
{
    // 0000 = No Connect
    // 0001 = U3TX
    // 0010 = U4RTS
    // 0101 = SDO1
    // 0110 = SDO2
    // 0111 = SDO3
    // 1001 = SDO5
    // 1010 = SS6
    // 1011 = OC3
    // 1100 = OC6
    // 1101 = REFCLKO4
    // 1110 = C2OUT
    // 1111 = C1TX
}

static void pps_output_group4 (unsigned address, unsigned data)
{
    // 0000 = No Connect
    // 0001 = U3RTS
    // 0010 = U4TX
    // 0100 = U6TX
    // 0101 = SS1
    // 0111 = SS3
    // 1000 = SS4
    // 1001 = SS5
    // 1010 = SDO6
    // 1011 = OC5
    // 1100 = OC8
    // 1110 = C1OUT
    // 1111 = REFCLKO3
}

void io_write32 (unsigned address, unsigned *bufp, unsigned data, const char **namep)
{
    unsigned mask;

    switch (address) {
    /*-------------------------------------------------------------------------
     * Interrupt controller registers.
     */
    WRITEOP (INTCON); return;   // Interrupt Control
    READONLY(INTSTAT);          // Interrupt Status
    WRITEOP (IPTMR);  return;   // Temporal Proximity Timer
    WRITEOP (IFS0); goto irq;	// IFS(0..2) - Interrupt Flag Status
    WRITEOP (IFS1); goto irq;
    WRITEOP (IFS2); goto irq;
    WRITEOP (IFS3); goto irq;
    WRITEOP (IFS4); goto irq;
    WRITEOP (IFS5); goto irq;
    WRITEOP (IEC0); goto irq;	// IEC(0..2) - Interrupt Enable Control
    WRITEOP (IEC1); goto irq;
    WRITEOP (IEC2); goto irq;
    WRITEOP (IEC3); goto irq;
    WRITEOP (IEC4); goto irq;
    WRITEOP (IEC5); goto irq;
    WRITEOP (IPC0); goto irq;	// IPC(0..11) - Interrupt Priority Control
    WRITEOP (IPC1); goto irq;
    WRITEOP (IPC2); goto irq;
    WRITEOP (IPC3); goto irq;
    WRITEOP (IPC4); goto irq;
    WRITEOP (IPC5); goto irq;
    WRITEOP (IPC6); goto irq;
    WRITEOP (IPC7); goto irq;
    WRITEOP (IPC8); goto irq;
    WRITEOP (IPC9); goto irq;
    WRITEOP (IPC10); goto irq;
    WRITEOP (IPC11); goto irq;
    WRITEOP (IPC12); goto irq;
    WRITEOP (IPC13); goto irq;
    WRITEOP (IPC14); goto irq;
    WRITEOP (IPC15); goto irq;
    WRITEOP (IPC16); goto irq;
    WRITEOP (IPC17); goto irq;
    WRITEOP (IPC18); goto irq;
    WRITEOP (IPC19); goto irq;
    WRITEOP (IPC20); goto irq;
    WRITEOP (IPC21); goto irq;
    WRITEOP (IPC22); goto irq;
    WRITEOP (IPC23); goto irq;
    WRITEOP (IPC24); goto irq;
    WRITEOP (IPC25); goto irq;
    WRITEOP (IPC26); goto irq;
    WRITEOP (IPC27); goto irq;
    WRITEOP (IPC28); goto irq;
    WRITEOP (IPC29); goto irq;
    WRITEOP (IPC30); goto irq;
    WRITEOP (IPC31); goto irq;
    WRITEOP (IPC32); goto irq;
    WRITEOP (IPC33); goto irq;
    WRITEOP (IPC34); goto irq;
    WRITEOP (IPC35); goto irq;
    WRITEOP (IPC36); goto irq;
    WRITEOP (IPC37); goto irq;
    WRITEOP (IPC38); goto irq;
    WRITEOP (IPC39); goto irq;
    WRITEOP (IPC40); goto irq;
    WRITEOP (IPC41); goto irq;
    WRITEOP (IPC42); goto irq;
    WRITEOP (IPC43); goto irq;
    WRITEOP (IPC44); goto irq;
    WRITEOP (IPC45); goto irq;
    WRITEOP (IPC46); goto irq;
    WRITEOP (IPC47);
irq:    update_irq_status();
        return;

    /*-------------------------------------------------------------------------
     * Prefetch controller.
     */
    WRITEOP (PRECON); return;   // Prefetch Control
    WRITEOP (PRESTAT); return;  // Prefetch Status

    /*-------------------------------------------------------------------------
     * System controller.
     */
    STORAGE (CFGCON);           // Configuration Control
        // TODO: use unlock sequence
        mask = PIC32_CFGCON_DMAPRI | PIC32_CFGCON_CPUPRI |
            PIC32_CFGCON_ICACLK | PIC32_CFGCON_OCACLK |
            PIC32_CFGCON_IOLOCK | PIC32_CFGCON_PMDLOCK |
            PIC32_CFGCON_PGLOCK | PIC32_CFGCON_USBSSEN |
            PIC32_CFGCON_ECC_MASK | PIC32_CFGCON_JTAGEN |
            PIC32_CFGCON_TROEN | PIC32_CFGCON_TDOEN;
        data = (data & mask) | (*bufp & ~mask);
        break;
    READONLY(DEVID);		// Device Identifier
    STORAGE (SYSKEY);		// System Key
	/* Unlock state machine. */
	if (syskey_unlock == 0 && VALUE(SYSKEY) == 0xaa996655)
	    syskey_unlock = 1;
	if (syskey_unlock == 1 && VALUE(SYSKEY) == 0x556699aa)
	    syskey_unlock = 2;
	else
	    syskey_unlock = 0;
	break;
    STORAGE (RCON); break;	// Reset Control
    STORAGE (RSWRST);		// Software Reset
	if (syskey_unlock == 2 && (VALUE(RSWRST) & 1)) {
            /* Reset CPU. */
            soft_reset();

            /* Reset all devices */
            io_reset();
            sdcard_reset();
        }
	break;
    STORAGE (OSCCON); break;	// Oscillator Control
    STORAGE (OSCTUN); break;	// Oscillator Tuning
    STORAGE (PB1DIV); break;	// Peripheral bus 1 divisor
    STORAGE (PB2DIV); break;	// Peripheral bus 2 divisor
    STORAGE (PB3DIV); break;	// Peripheral bus 3 divisor
    STORAGE (PB4DIV); break;	// Peripheral bus 4 divisor
    STORAGE (PB5DIV); break;	// Peripheral bus 5 divisor
    STORAGE (PB7DIV); break;	// Peripheral bus 7 divisor
    STORAGE (PB8DIV); break;	// Peripheral bus 8 divisor

    /*-------------------------------------------------------------------------
     * Peripheral port select registers: input.
     */
    STORAGE (INT1R);    pps_input_group1 (address, data); break;
    STORAGE (T4CKR);    pps_input_group1 (address, data); break;
    STORAGE (T9CKR);    pps_input_group1 (address, data); break;
    STORAGE (IC1R);     pps_input_group1 (address, data); break;
    STORAGE (IC6R);     pps_input_group1 (address, data); break;
    STORAGE (U3CTSR);   pps_input_group1 (address, data); break;
    STORAGE (U4RXR);    pps_input_group1 (address, data); break;
    STORAGE (U6RXR);    pps_input_group1 (address, data); break;
    STORAGE (SS2R);     pps_input_group1 (address, data); break;
    STORAGE (SDI6R);    pps_input_group1 (address, data); break;
    STORAGE (OCFAR);    pps_input_group1 (address, data); break;
    STORAGE (REFCLKI3R);pps_input_group1 (address, data); break;

    STORAGE (INT2R);    pps_input_group2 (address, data); break;
    STORAGE (T3CKR);    pps_input_group2 (address, data); break;
    STORAGE (T8CKR);    pps_input_group2 (address, data); break;
    STORAGE (IC2R);     pps_input_group2 (address, data); break;
    STORAGE (IC5R);     pps_input_group2 (address, data); break;
    STORAGE (IC9R);     pps_input_group2 (address, data); break;
    STORAGE (U1CTSR);   pps_input_group2 (address, data); break;
    STORAGE (U2RXR);    pps_input_group2 (address, data); break;
    STORAGE (U5CTSR);   pps_input_group2 (address, data); break;
    STORAGE (SS1R);     pps_input_group2 (address, data); break;
    STORAGE (SS3R);     pps_input_group2 (address, data); break;
    STORAGE (SS4R);     pps_input_group2 (address, data); break;
    STORAGE (SS5R);     pps_input_group2 (address, data); break;
    STORAGE (C2RXR);    pps_input_group2 (address, data); break;

    STORAGE (INT3R);    pps_input_group3 (address, data); break;
    STORAGE (T2CKR);    pps_input_group3 (address, data); break;
    STORAGE (T6CKR);    pps_input_group3 (address, data); break;
    STORAGE (IC3R);     pps_input_group3 (address, data); break;
    STORAGE (IC7R);     pps_input_group3 (address, data); break;
    STORAGE (U1RXR);    pps_input_group3 (address, data); break;
    STORAGE (U2CTSR);   pps_input_group3 (address, data); break;
    STORAGE (U5RXR);    pps_input_group3 (address, data); break;
    STORAGE (U6CTSR);   pps_input_group3 (address, data); break;
    STORAGE (SDI1R);    pps_input_group3 (address, data); break;
    STORAGE (SDI3R);    pps_input_group3 (address, data); break;
    STORAGE (SDI5R);    pps_input_group3 (address, data); break;
    STORAGE (SS6R);     pps_input_group3 (address, data); break;
    STORAGE (REFCLKI1R);pps_input_group3 (address, data); break;

    STORAGE (INT4R);    pps_input_group4 (address, data); break;
    STORAGE (T5CKR);    pps_input_group4 (address, data); break;
    STORAGE (T7CKR);    pps_input_group4 (address, data); break;
    STORAGE (IC4R);     pps_input_group4 (address, data); break;
    STORAGE (IC8R);     pps_input_group4 (address, data); break;
    STORAGE (U3RXR);    pps_input_group4 (address, data); break;
    STORAGE (U4CTSR);   pps_input_group4 (address, data); break;
    STORAGE (SDI2R);    pps_input_group4 (address, data); break;
    STORAGE (SDI4R);    pps_input_group4 (address, data); break;
    STORAGE (C1RXR);    pps_input_group4 (address, data); break;
    STORAGE (REFCLKI4R);pps_input_group4 (address, data); break;

    /*-------------------------------------------------------------------------
     * Peripheral port select registers: output.
     */
    STORAGE (RPA15R);   pps_output_group1 (address, data); break;
    STORAGE (RPB1R);    pps_output_group1 (address, data); break;
    STORAGE (RPB3R);    pps_output_group1 (address, data); break;
    STORAGE (RPC4R);    pps_output_group1 (address, data); break;
    STORAGE (RPC13R);   pps_output_group1 (address, data); break;
    STORAGE (RPD3R);    pps_output_group1 (address, data); break;
    STORAGE (RPD7R);    pps_output_group1 (address, data); break;
    STORAGE (RPD11R);   pps_output_group1 (address, data); break;
    STORAGE (RPD15R);   pps_output_group1 (address, data); break;
    STORAGE (RPE5R);    pps_output_group1 (address, data); break;
    STORAGE (RPF0R);    pps_output_group1 (address, data); break;
    STORAGE (RPF5R);    pps_output_group1 (address, data); break;
    STORAGE (RPG0R);    pps_output_group1 (address, data); break;
    STORAGE (RPG7R);    pps_output_group1 (address, data); break;

    STORAGE (RPB2R);    pps_output_group2 (address, data); break;
    STORAGE (RPB6R);    pps_output_group2 (address, data); break;
    STORAGE (RPB14R);   pps_output_group2 (address, data); break;
    STORAGE (RPC2R);    pps_output_group2 (address, data); break;
    STORAGE (RPD0R);    pps_output_group2 (address, data); break;
    STORAGE (RPD1R);    pps_output_group2 (address, data); break;
    STORAGE (RPD5R);    pps_output_group2 (address, data); break;
    STORAGE (RPE8R);    pps_output_group2 (address, data); break;
    STORAGE (RPF2R);    pps_output_group2 (address, data); break;
    STORAGE (RPF3R);    pps_output_group2 (address, data); break;
    STORAGE (RPF13R);   pps_output_group2 (address, data); break;
    STORAGE (RPG9R);    pps_output_group2 (address, data); break;

    STORAGE (RPA14R);   pps_output_group3 (address, data); break;
    STORAGE (RPB5R);    pps_output_group3 (address, data); break;
    STORAGE (RPB9R);    pps_output_group3 (address, data); break;
    STORAGE (RPB10R);   pps_output_group3 (address, data); break;
    STORAGE (RPC1R);    pps_output_group3 (address, data); break;
    STORAGE (RPC14R);   pps_output_group3 (address, data); break;
    STORAGE (RPD2R);    pps_output_group3 (address, data); break;
    STORAGE (RPD6R);    pps_output_group3 (address, data); break;
    STORAGE (RPD10R);   pps_output_group3 (address, data); break;
    STORAGE (RPD14R);   pps_output_group3 (address, data); break;
    STORAGE (RPF1R);    pps_output_group3 (address, data); break;
    STORAGE (RPF4R);    pps_output_group3 (address, data); break;
    STORAGE (RPG1R);    pps_output_group3 (address, data); break;
    STORAGE (RPG8R);    pps_output_group3 (address, data); break;

    STORAGE (RPB0R);    pps_output_group4 (address, data); break;
    STORAGE (RPB7R);    pps_output_group4 (address, data); break;
    STORAGE (RPB8R);    pps_output_group4 (address, data); break;
    STORAGE (RPB15R);   pps_output_group4 (address, data); break;
    STORAGE (RPC3R);    pps_output_group4 (address, data); break;
    STORAGE (RPD4R);    pps_output_group4 (address, data); break;
    STORAGE (RPD9R);    pps_output_group4 (address, data); break;
    STORAGE (RPD12R);   pps_output_group4 (address, data); break;
    STORAGE (RPE3R);    pps_output_group4 (address, data); break;
    STORAGE (RPE9R);    pps_output_group4 (address, data); break;
    STORAGE (RPF8R);    pps_output_group4 (address, data); break;
    STORAGE (RPF12R);   pps_output_group4 (address, data); break;
    STORAGE (RPG6R);    pps_output_group4 (address, data); break;

    /*-------------------------------------------------------------------------
     * General purpose IO signals.
     */
    WRITEOP (ANSELA); return;	    // Port A: analog select
    WRITEOP (TRISA); return;	    // Port A: mask of inputs
    WRITEOPX(PORTA, LATA);          // Port A: write outputs
    WRITEOP (LATA);                 // Port A: write outputs
        gpio_write (0, VALUE(LATA));
	return;
    WRITEOP (ODCA); return;	    // Port A: open drain configuration
    WRITEOP (CNPUA); return;	    // Input pin pull-up
    WRITEOP (CNPDA); return;	    // Input pin pull-down
    WRITEOP (CNCONA); return;	    // Interrupt-on-change control
    WRITEOP (CNENA); return;	    // Input change interrupt enable
    WRITEOP (CNSTATA); return;	    // Input change status

    WRITEOP (ANSELB); return;	    // Port B: analog select
    WRITEOP (TRISB); return;	    // Port B: mask of inputs
    WRITEOPX(PORTB, LATB);          // Port B: write outputs
    WRITEOP (LATB);		    // Port B: write outputs
        gpio_write (1, VALUE(LATB));
	return;
    WRITEOP (ODCB); return;	    // Port B: open drain configuration
    WRITEOP (CNPUB); return;	    // Input pin pull-up
    WRITEOP (CNPDB); return;	    // Input pin pull-down
    WRITEOP (CNCONB); return;	    // Interrupt-on-change control
    WRITEOP (CNENB); return;	    // Input change interrupt enable
    WRITEOP (CNSTATB); return;	    // Input change status

    WRITEOP (ANSELC); return;	    // Port C: analog select
    WRITEOP (TRISC); return;	    // Port C: mask of inputs
    WRITEOPX(PORTC, LATC);          // Port C: write outputs
    WRITEOP (LATC);                 // Port C: write outputs
        gpio_write (2, VALUE(LATC));
	return;
    WRITEOP (ODCC); return;	    // Port C: open drain configuration
    WRITEOP (CNPUC); return;	    // Input pin pull-up
    WRITEOP (CNPDC); return;	    // Input pin pull-down
    WRITEOP (CNCONC); return;	    // Interrupt-on-change control
    WRITEOP (CNENC); return;	    // Input change interrupt enable
    WRITEOP (CNSTATC); return;	    // Input change status

    WRITEOP (ANSELD); return;	    // Port D: analog select
    WRITEOP (TRISD); return;	    // Port D: mask of inputs
    WRITEOPX(PORTD, LATD);          // Port D: write outputs
    WRITEOP (LATD);		    // Port D: write outputs
        gpio_write (3, VALUE(LATD));
	return;
    WRITEOP (ODCD); return;	    // Port D: open drain configuration
    WRITEOP (CNPUD); return;	    // Input pin pull-up
    WRITEOP (CNPDD); return;	    // Input pin pull-down
    WRITEOP (CNCOND); return;	    // Interrupt-on-change control
    WRITEOP (CNEND); return;	    // Input change interrupt enable
    WRITEOP (CNSTATD); return;	    // Input change status

    WRITEOP (ANSELE); return;	    // Port E: analog select
    WRITEOP (TRISE); return;	    // Port E: mask of inputs
    WRITEOPX(PORTE, LATE);          // Port E: write outputs
    WRITEOP (LATE);		    // Port E: write outputs
        gpio_write (4, VALUE(LATE));
	return;
    WRITEOP (ODCE); return;	    // Port E: open drain configuration
    WRITEOP (CNPUE); return;	    // Input pin pull-up
    WRITEOP (CNPDE); return;	    // Input pin pull-down
    WRITEOP (CNCONE); return;	    // Interrupt-on-change control
    WRITEOP (CNENE); return;	    // Input change interrupt enable
    WRITEOP (CNSTATE); return;	    // Input change status

    WRITEOP (ANSELF); return;	    // Port F: analog select
    WRITEOP (TRISF); return;	    // Port F: mask of inputs
    WRITEOPX(PORTF, LATF);          // Port F: write outputs
    WRITEOP (LATF);		    // Port F: write outputs
        gpio_write (5, VALUE(LATF));
	return;
    WRITEOP (ODCF); return;	    // Port F: open drain configuration
    WRITEOP (CNPUF); return;	    // Input pin pull-up
    WRITEOP (CNPDF); return;	    // Input pin pull-down
    WRITEOP (CNCONF); return;	    // Interrupt-on-change control
    WRITEOP (CNENF); return;	    // Input change interrupt enable
    WRITEOP (CNSTATF); return;	    // Input change status

    WRITEOP (ANSELG); return;	    // Port G: analog select
    WRITEOP (TRISG); return;	    // Port G: mask of inputs
    WRITEOPX(PORTG, LATG);          // Port G: write outputs
    WRITEOP (LATG);		    // Port G: write outputs
        gpio_write (6, VALUE(LATG));
	return;
    WRITEOP (ODCG); return;	    // Port G: open drain configuration
    WRITEOP (CNPUG); return;	    // Input pin pull-up
    WRITEOP (CNPDG); return;	    // Input pin pull-down
    WRITEOP (CNCONG); return;	    // Interrupt-on-change control
    WRITEOP (CNENG); return;	    // Input change interrupt enable
    WRITEOP (CNSTATG); return;	    // Input change status

    /*-------------------------------------------------------------------------
     * UART 1.
     */
    STORAGE (U1TXREG);                              // Transmit
        uart_put_char (0, data);
        break;
    WRITEOP (U1MODE);                               // Mode
        uart_update_mode (0);
        return;
    WRITEOPR (U1STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        uart_update_status (0);
        return;
    WRITEOP (U1BRG); return;                        // Baud rate
    READONLY (U1RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 2.
     */
    STORAGE (U2TXREG);                              // Transmit
        uart_put_char (1, data);
        break;
    WRITEOP (U2MODE);                               // Mode
        uart_update_mode (1);
        return;
    WRITEOPR (U2STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        uart_update_status (1);
        return;
    WRITEOP (U2BRG); return;                        // Baud rate
    READONLY (U2RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 3.
     */
    STORAGE (U3TXREG);                              // Transmit
        uart_put_char (2, data);
        break;
    WRITEOP (U3MODE);                               // Mode
        uart_update_mode (2);
        return;
    WRITEOPR (U3STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        uart_update_status (2);
        return;
    WRITEOP (U3BRG); return;                        // Baud rate
    READONLY (U3RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 4.
     */
    STORAGE (U4TXREG);                              // Transmit
        uart_put_char (3, data);
        break;
    WRITEOP (U4MODE);                               // Mode
        uart_update_mode (3);
        return;
    WRITEOPR (U4STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        uart_update_status (3);
        return;
    WRITEOP (U4BRG); return;                        // Baud rate
    READONLY (U4RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 5.
     */
    STORAGE (U5TXREG);                              // Transmit
        uart_put_char (4, data);
        break;
    WRITEOP (U5MODE);                               // Mode
        uart_update_mode (4);
        return;
    WRITEOPR (U5STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        uart_update_status (4);
        return;
    WRITEOP (U5BRG); return;                        // Baud rate
    READONLY (U5RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 6.
     */
    STORAGE (U6TXREG);                              // Transmit
        uart_put_char (5, data);
        break;
    WRITEOP (U6MODE);                               // Mode
        uart_update_mode (5);
        return;
    WRITEOPR (U6STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        uart_update_status (5);
        return;
    WRITEOP (U6BRG); return;                        // Baud rate
    READONLY (U6RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * SPI.
     */
    WRITEOP (SPI1CON);                              // Control
	spi_control (0);
        return;
    WRITEOPR (SPI1STAT, ~PIC32_SPISTAT_SPIROV);     // Status
        return;                                     // Only ROV bit is writable
    STORAGE (SPI1BUF);                              // Buffer
        spi_writebuf (0, data);
        return;
    WRITEOP (SPI1BRG); return;                      // Baud rate
    WRITEOP (SPI1CON2); return;                     // Control 2

    WRITEOP (SPI2CON);                              // Control
	spi_control (1);
        return;
    WRITEOPR (SPI2STAT, ~PIC32_SPISTAT_SPIROV);     // Status
        return;                                     // Only ROV bit is writable
    STORAGE (SPI2BUF);                              // Buffer
        spi_writebuf (1, data);
        return;
    WRITEOP (SPI2BRG); return;                      // Baud rate
    WRITEOP (SPI2CON2); return;                     // Control 2

